
#ifndef XC_HEADER_TEMPLATE_H
#define	XC_HEADER_TEMPLATE_H
#include <xc.h> // include processor files - each processor file is guarded.  
#endif	/* XC_HEADER_TEMPLATE_H */

// EEPROM (0У380000-0x3803FF) - 1024(400h)
   // ОПЕДБЮПХРЕКЭМШИ(НРКЮДНВМШИ) ЮДПЕЯЯ UID     
__EEPROM_DATA(0xFF,0xDE,0xBC,0xAA,0x1C,0x04,0,0); // UID , IPE; debuge UID
__EEPROM_DATA(0,0,0,0,0,0,0,0); // Device_Label
__EEPROM_DATA(0,0,0,0,0,0,0,0); // Device_Label
__EEPROM_DATA(0,0,0,0,0,0,0,0); // Device_Label

// dmx adrH,adrL,personality,curve,CurModFreq,ActivPreset, AutoStart
__EEPROM_DATA(0,1,5,1,0xB,1,0,255); // 0x20-0x27 // (0,1,5,1,0xB,0,255,255)
__EEPROM_DATA(0,0,0,0,0,0,0,0);     // 0x28-0x2F

// 0x30-0x37 
__EEPROM_DATA(0,0,0,0,0,0,0,0);  // 
// 0x38-0x3F  
__EEPROM_DATA(0,0,0,0,0,0,0,0);  // -/-
// 0x40-0x47  
__EEPROM_DATA(0,0,0,0,0,0,0,0);  // -/-
// 0x48-0x4F 
__EEPROM_DATA(0,0,0,0,0,0,0,0);  // -/-
// 0x50-0x57 
__EEPROM_DATA(0,0,0,0,0,0,0,0);   //   
// 0x58-0x5F 
__EEPROM_DATA('ю','й','р','х','б','х','п','н');   // "юйрхбхпнбюм" (1)
// 0x60-0x67 
__EEPROM_DATA('б','ю','м',0,0,0,0,0);  // -/-
// 0x68-0x6F 
__EEPROM_DATA('п','е','ф','х','л',0,0,'м');    //   "пефхл"
// 0x70-0x77   
__EEPROM_DATA('ю','о','п','ю','б','й','ю',0);  //" мюопюбйю "
 // 0x78-0x7F  
__EEPROM_DATA('ю','д','п','е','я',' ','D','M');  // "юдпея DMX", (4)
// 0x80-0x87  
__EEPROM_DATA('X',0,0,0,0,0,0,0);  // 
// 0x88-0x8F 
__EEPROM_DATA('о','п','н','т','х','к','э',' ');   // "опнтхкэ DMX", (5)
// 0x90-0x97 
__EEPROM_DATA('D','M','X',0,0,0,0,0);   // 
// 0x98-0x9F  
__EEPROM_DATA('о','п','е','я','е','р','ш',0);  // "опеяерш",
// 0xA0-0xA7 
__EEPROM_DATA('п','е','ф','х','л',' ','д','х');   // "пефхл дхллепю",
// 0xA8-0xAF  
__EEPROM_DATA('л','л','е','п','ю',0,0,0);   //    
// 0xB0-0xB7 
__EEPROM_DATA('в','ю','я','р','н','р','ю',' ');   // "вюярнрю ьхл", (8)
// 0xB8-0xBF  
__EEPROM_DATA('ь','х','л',0,0,0,0,0);  // 
// 0xC0-0xC7 
__EEPROM_DATA('х','м','т','н','п','л','ю','ж');   //   "хмтнплюжхъ" (9)
// 0xC8-0xCF  
__EEPROM_DATA('х','ъ',0,0,0,0,0,'с');  //  "сярюмнбйю юдпеяю" (10)
// 0xD0-0xD7 
__EEPROM_DATA('я','р','ю','м','н','б','й','ю');   // -/-
// 0xD8-0xDF 
__EEPROM_DATA(' ','ю','д','п','е','я','ю',0);    //  -/-
// 0xE0-0xE7
__EEPROM_DATA('с','я','р','ю','м','н','б','к');  // "сярюмнбкеммши:"
// 0xE8-0xEF
__EEPROM_DATA('е','м','м','ш','и',':',0,0); // 
// 0xF0-0xF7
__EEPROM_DATA('м','н','б','ш','и',':',0,0); // "мнбши:" (12)
 // 0xF8-0xFF
__EEPROM_DATA('о','н','я','к','е','д','с','ч'); // "онякедсчыхи:"
// 100h-107h
__EEPROM_DATA('ы','х','и',':',0,'о','п','н'); // "опнтхкэ сопюбкемхъ"
// 108h-10Fh
__EEPROM_DATA('т','х','к','э',' ','с','о','п');  // -/-
// 110h-117h
__EEPROM_DATA('ю','б','к','е','м','х','ъ',0); // -/-
// 118h-11Fh
__EEPROM_DATA('й','н','к','х','в','е','я','р'); // "йнкхвеярбн йюмюкнб"
// 120h-127h
__EEPROM_DATA('б','н',' ','й','ю','м','ю','к'); // -/-
// 128h-12Fh
__EEPROM_DATA('н','б',' ',0,0,0,0,0);  // -/-
// 130h-137h
__EEPROM_DATA('т','с','м','й','ж','х','ъ',' '); // "тсмйжхъ дхллепю"
// 138h-13Fh
__EEPROM_DATA('д','х','л','л','е','п','ю',0); // -/-
// 140h-147h
__EEPROM_DATA('к','х','м','е','и','м','ю','ъ'); // "кхмеимюъ"
// 148h-14Fh
__EEPROM_DATA(0,0,'й','б','ю','д','п','ю'); // "йбюдпюрхвмюъ"
// 150h-157h
__EEPROM_DATA('р','х','в','м','ю','ъ',0,0); // -/-
// 158h-15Fh
__EEPROM_DATA('р','е','ю','р','п','ю','к','э'); // "реюрпюкэмюъ"
// 160h-167h
__EEPROM_DATA('м','ю','ъ',0,0,0,0,0); 
// 168h-16Fh
__EEPROM_DATA('ц','ю','к','н','ц','е','м',0); // "цюкнцем" 
// 170h-177h
__EEPROM_DATA('й','н','п','п','е','й','ж','х'); // "йнппейжхъ вюярнрш ьхл"
// 178-17F
__EEPROM_DATA('ъ',' ','в','ю','я','р','н','р'); // -/-
// 180-187
__EEPROM_DATA('ш',' ','ь','х','л',0,0,0); // -/-
// 188-18F
__EEPROM_DATA('ц','Ж',0,0,'U','I','D',0); // "цЖ"  "UID" 
// 190-197
__EEPROM_DATA('б','е','п','я','х','ъ',' ','о'); // "бепяхъ он"
// 198-19F
__EEPROM_DATA('н',0,0,0,0,0,0,0); // 

__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); // '','','','','','','',''
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
__EEPROM_DATA(0,0,0,0,0,0,0,0); 
 
